# Pandas 进阶

## 1. Group操作：数据聚合

**1.1 生成DataFrame**

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns;

In [2]:
period = pd.date_range('2017-1-1', periods=10000, freq='D')   
df = pd.DataFrame(np.random.randn(10000, 4),
                  columns=['Data1', 'Data2', 'Data3', 'Data4'],
                  index = period)

In [3]:
df.head()      #快速预览前5行；

               Data1     Data2     Data3     Data4
2017-01-01 -0.546057  0.485809  0.271526 -0.101068
2017-01-02  0.533121 -2.568723 -1.301011 -0.768564
2017-01-03  0.503637 -0.952887  0.276748  1.242785
2017-01-04 -0.261805 -1.725207  2.018913  0.727646
2017-01-05  0.327719 -1.084610 -0.315303  0.146023

#### 1.2 新增一例用于Group操作

In [4]:
df['group1'] = np.random.choice(['A', 'B', 'C', 'D'], 10000)       #np.random.choice

In [6]:
df.tail()

               Data1     Data2     Data3     Data4 group1
2044-05-14  0.170887 -0.177383 -1.734083  0.332373      C
2044-05-15  1.121012  0.835464 -1.034102  0.079695      A
2044-05-16 -0.400131 -0.183320  0.032977  0.244478      B
2044-05-17  0.077076 -1.454735 -0.843961  1.770664      C
2044-05-18  0.800873 -1.034937 -0.177725 -1.546404      D

In [7]:
df.head()

               Data1     Data2     Data3     Data4 group1
2017-01-01 -0.546057  0.485809  0.271526 -0.101068      B
2017-01-02  0.533121 -2.568723 -1.301011 -0.768564      A
2017-01-03  0.503637 -0.952887  0.276748  1.242785      D
2017-01-04 -0.261805 -1.725207  2.018913  0.727646      A
2017-01-05  0.327719 -1.084610 -0.315303  0.146023      C

**1.3 生成DataFrameGroupBy对象**

In [8]:
grouped = df.groupby('group1')     #df.groupby();必背；

In [9]:
grouped

In [10]:
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [12]:
grouped.size()           #每组元素数量

group1
A    2421
B    2490
C    2499
D    2590
dtype: int64

#### 1.4 Group对象的聚合运算

In [13]:
grouped.sum()

            Data1      Data2       Data3      Data4
group1
A      -55.618918 -22.605940 -142.412315   8.183715
B       30.162507  -3.333783   13.506594 -32.747135
C       23.683299  18.628483   -5.846106 -12.907839
D       44.170365 -18.886489  -26.611957  72.402915

In [14]:
grouped.max()

           Data1     Data2     Data3     Data4
group1
A       4.039558  3.959512  3.900227  3.562431
B       3.487299  3.009574  3.138222  3.247698
C       3.830694  3.073445  3.477502  3.126472
D       3.892288  3.464834  3.095179  3.342041

In [15]:
grouped.mean()

           Data1     Data2     Data3     Data4
group1
A      -0.022974 -0.009337 -0.058824  0.003380
B       0.012113 -0.001339  0.005424 -0.013151
C       0.009477  0.007454 -0.002339 -0.005165
D       0.017054 -0.007292 -0.010275  0.027955

In [16]:
grouped.describe()        #整体数据特征概览；

         Data1                                                              \
         count      mean       std       min       25%       50%       75%
group1
A       2421.0 -0.022974  0.988331 -3.483872 -0.693473 -0.024418  0.638969
B       2490.0  0.012113  0.995739 -3.426703 -0.635425  0.007583  0.676657
C       2499.0  0.009477  1.024529 -3.975706 -0.679099  0.016390  0.700021
D       2590.0  0.017054  0.996643 -3.123994 -0.681255  0.029691  0.712717

                   Data2            ...     Data3             Data4            \
             max   count      mean  ...       75%       max   count      mean
group1                              ...
A       4.039558  2421.0 -0.009337  ...  0.644677  3.900227  2421.0  0.003380
B       3.487299  2490.0 -0.001339  ...  0.663914  3.138222  2490.0 -0.013151
C       3.830694  2499.0  0.007454  ...  0.678191  3.477502  2499.0 -0.005165
D       3.892288  2590.0 -0.007292  ...  0.670508  3.095179  2590.0  0.027955


             std       min       25%       50%       75%       max
group1
A       1.004613 -3.742931 -0.674958  0.003865  0.654615  3.562431
B       1.000953 -3.883815 -0.684835  0.005617  0.677426  3.247698
C       0.972741 -3.264068 -0.672219  0.014023  0.640463  3.126472
D       0.984042 -2.986791 -0.638121  0.044036  0.681669  3.342041

[4 rows x 32 columns]

In [18]:
np.transpose(grouped.describe() )

group1                 A            B            C            D
Data1 count  2421.000000  2490.000000  2499.000000  2590.000000
      mean     -0.022974     0.012113     0.009477     0.017054
      std       0.988331     0.995739     1.024529     0.996643
      min      -3.483872    -3.426703    -3.975706    -3.123994
      25%      -0.693473    -0.635425    -0.679099    -0.681255
      50%      -0.024418     0.007583     0.016390     0.029691
      75%       0.638969     0.676657     0.700021     0.712717
      max       4.039558     3.487299     3.830694     3.892288
Data2 count  2421.000000  2490.000000  2499.000000  2590.000000
      mean     -0.009337    -0.001339     0.007454    -0.007292
      std       0.982931     0.989484     0.991534     1.011388
      min      -3.105877    -3.113528    -3.252992    -3.435492
      25%      -0.680883    -0.688544    -0.641055    -0.733928
      50%      -0.001281    -0.008370     0.011151    -0.005181
      75%       0.655780     0.648792     0.675994     0.677998
      max       3.959512     3.009574     3.073445     3.464834
Data3 count  2421.000000  2490.000000  2499.000000  2590.000000
      mean     -0.058824     0.005424    -0.002339    -0.010275
      std       1.005123     0.981905     1.002503     0.992937
      min      -3.218036    -2.979363    -3.357380    -3.516477
      25%      -0.730258    -0.653713    -0.674276    -0.696166
      50%      -0.041033     0.001158    -0.018291    -0.009909
      75%       0.644677     0.663914     0.678191     0.670508
      max       3.900227     3.138222     3.477502     3.095179
Data4 count  2421.000000  2490.000000  2499.000000  2590.000000
      mean      0.003380    -0.013151    -0.005165     0.027955
      std       1.004613     1.000953     0.972741     0.984042
      min      -3.742931    -3.883815    -3.264068    -2.986791
      25%      -0.674958    -0.684835    -0.672219    -0.638121
      50%       0.003865     0.005617     0.014023     0.044036
      75%       0.654615     0.677426     0.640463     0.681669
      max       3.562431     3.247698     3.126472     3.342041

#### 1.5 选择Group对象中的数据

In [19]:
grouped.get_group('A').head()    #get_group()

               Data1     Data2     Data3     Data4 group1
2017-01-02  0.533121 -2.568723 -1.301011 -0.768564      A
2017-01-04 -0.261805 -1.725207  2.018913  0.727646      A
2017-01-11 -1.437821 -1.219899  0.807925 -0.176256      A
2017-01-16 -1.351172  0.701713  0.244003 -1.830107      A
2017-01-20  1.788625  0.024829 -1.806473  0.746747      A

In [20]:
grouped.get_group('B').head()

               Data1     Data2     Data3     Data4 group1
2017-01-01 -0.546057  0.485809  0.271526 -0.101068      B
2017-01-13 -0.437989 -0.955484  1.733208 -1.686564      B
2017-01-14  0.783482 -0.511931  0.208867 -1.064160      B
2017-01-22 -0.210645  0.010223 -1.911574  0.036446      B
2017-01-25 -0.329076  1.760097 -0.051402 -0.784779      B

In [22]:
grouped.           #tab键查看对应其对应的方法

pandas.core.groupby.generic.DataFrameGroupBy

#### 1.6 双重Group

In [23]:
df['group2'] = np.random.choice(['Python','C++','Java'], 10000)

In [24]:
df.head()

               Data1     Data2     Data3     Data4 group1 group2
2017-01-01 -0.546057  0.485809  0.271526 -0.101068      B   Java
2017-01-02  0.533121 -2.568723 -1.301011 -0.768564      A   Java
2017-01-03  0.503637 -0.952887  0.276748  1.242785      D   Java
2017-01-04 -0.261805 -1.725207  2.018913  0.727646      A   Java
2017-01-05  0.327719 -1.084610 -0.315303  0.146023      C    C++

In [25]:
grouped = df.groupby(['group1', 'group2'])
grouped.size()                                    #多组分类

group1  group2
A       C++       823
        Java      799
        Python    799
B       C++       878
        Java      800
        Python    812
C       C++       804
        Java      848
        Python    847
D       C++       870
        Java      871
        Python    849
dtype: int64

In [26]:
grouped.max()

                  Data1     Data2     Data3     Data4
group1 group2
A      C++     3.190600  3.959512  2.997936  3.562431
       Java    2.663028  3.481206  3.162399  3.262174
       Python  4.039558  2.910157  3.900227  2.811884
B      C++     3.050618  2.771034  2.699080  2.819964
       Java    3.487299  3.009574  2.684646  3.247698
       Python  3.015203  2.685822  3.138222  2.965580
C      C++     2.683622  2.933570  3.477502  3.126472
       Java    3.009847  3.073445  3.004545  2.939077
       Python  3.830694  2.886652  3.112836  2.700130
D      C++     3.007815  3.464834  3.095179  3.109603
       Java    3.268574  2.716332  2.690239  3.342041
       Python  3.892288  3.436476  2.688189  2.931458

In [27]:
grouped.min()

                  Data1     Data2     Data3     Data4
group1 group2
A      C++    -2.959609 -3.094755 -3.069059 -3.742931
       Java   -3.406870 -3.105877 -3.218036 -3.240548
       Python -3.483872 -2.675660 -3.088843 -3.242521
B      C++    -3.426703 -3.053811 -2.979363 -3.833672
       Java   -2.966320 -3.113528 -2.905100 -3.883815
       Python -3.171815 -2.698816 -2.631941 -2.946021
C      C++    -3.975706 -3.118287 -2.618553 -3.011548
       Java   -3.255773 -3.252992 -3.357380 -3.264068
       Python -3.372544 -3.046156 -3.354677 -2.763346
D      C++    -2.805223 -2.735691 -3.022724 -2.986791
       Java   -2.892177 -2.662967 -3.258573 -2.945635
       Python -3.123994 -3.435492 -3.516477 -2.768220

In [28]:
grouped.agg([np.max, np.sum])               #自定义聚合.分类汇总、查看，可以自定义聚合；

                  Data1                Data2                Data3             \
                   amax        sum      amax        sum      amax        sum
group1 group2
A      C++     3.190600 -17.108908  3.959512 -18.495800  2.997936 -57.415544
       Java    2.663028 -20.766799  3.481206   6.518092  3.162399 -19.297443
       Python  4.039558 -17.743210  2.910157 -10.628232  3.900227 -65.699327
B      C++     3.050618  43.637131  2.771034 -49.134873  2.699080  28.224126
       Java    3.487299 -23.921524  3.009574  69.195373  2.684646 -36.525015
       Python  3.015203  10.446899  2.685822 -23.394283  3.138222  21.807483
C      C++     2.683622   2.721442  2.933570 -24.027603  3.477502  35.303458
       Java    3.009847  10.472955  3.073445  43.682551  3.004545 -49.428586
       Python  3.830694  10.488901  2.886652  -1.026465  3.112836   8.279022
D      C++     3.007815  -2.533045  3.464834  21.460973  3.095179 -10.017261
       Java    3.268574   4.888391  2.716332  -9.124124  2.690239 -11.068216
       Python  3.892288  41.815019  3.436476 -31.223338  2.688189  -5.526480

                  Data4
                   amax        sum
group1 group2
A      C++     3.562431 -13.988651
       Java    3.262174  12.651405
       Python  2.811884   9.520961
B      C++     2.819964 -49.996141
       Java    3.247698   4.018102
       Python  2.965580  13.230904
C      C++     3.126472 -16.861743
       Java    2.939077  20.079492
       Python  2.700130 -16.125589
D      C++     3.109603  22.261089
       Java    3.342041  47.615607
       Python  2.931458   2.526220

In [29]:
grouped.agg({'Data1':np.mean, 'Data2':np.max})

                  Data1     Data2
group1 group2
A      C++    -0.020788  3.959512
       Java   -0.025991  3.481206
       Python -0.022207  2.910157
B      C++     0.049701  2.771034
       Java   -0.029902  3.009574
       Python  0.012866  2.685822
C      C++     0.003385  2.933570
       Java    0.012350  3.073445
       Python  0.012384  2.886652
D      C++    -0.002912  3.464834
       Java    0.005612  2.716332
       Python  0.049252  3.436476

### 2. Pandas中Concat, Join, Merge操作

#### 2.1 生成DataFrame

In [20]:
df1 = pd.DataFrame(['10', '20', '25', '30'], 
                    index=['a', 'b', 'c', 'd'],
                    columns=['PE',])
df1

   PE
a  10
b  20
c  25
d  30

In [25]:
df2 = pd.DataFrame(['2.5', '3.2', '2.5'], 
                    index=['a', 'd', 'g'],
                    columns=['PB',])
df2

    PB
a  2.5
d  3.2
g  2.5

#### 2.2 Concat操作

In [26]:
pd.concat((df1, df2))    #默认是直接拼接在后面；

    PB   PE
a  NaN   10
b  NaN   20
c  NaN   25
d  NaN   30
a  2.5  NaN
d  3.2  NaN
g  2.5  NaN

In [27]:
pd.concat((df1, df2),axis =1)          #横向拼接concat很有用，会自动匹配索引；join(Outer),并集；

    PE   PB
a   10  2.5
b   20  NaN
c   25  NaN
d   30  3.2
g  NaN  2.5

In [28]:
pd.concat((df1, df2), ignore_index=True)    #不要索引值

    PB   PE
0  NaN   10
1  NaN   20
2  NaN   25
3  NaN   30
4  2.5  NaN
5  3.2  NaN
6  2.5  NaN

#### 2.3 Join操作

是根据两张表格的索引去进行合并

In [31]:
print(df1)
print(df2)

   PE
a  10
b  20
c  25
d  30
    PB
a  2.5
d  3.2
g  2.5

In [29]:
df1.join(df2)                     # left join = default,默认按照左边表格对齐；

   PE   PB
a  10  2.5
b  20  NaN
c  25  NaN
d  30  3.2

In [32]:
df1.join(df2, how='left')  # default，how控制的是按索引合并的方法；

   PE   PB
a  10  2.5
b  20  NaN
c  25  NaN
d  30  3.2

In [33]:
df2.join(df1)

    PB   PE
a  2.5   10
d  3.2   30
g  2.5  NaN

In [37]:
df = pd.DataFrame({'PE': df1['PE'], 'PB': df2['PB']})                    #使用DataFrame进行拼接操作
df

    PB   PE
a  2.5   10
b  NaN   20
c  NaN   25
d  3.2   30
g  2.5  NaN

In [34]:
df1.join(df2, how='right')

    PE   PB
a   10  2.5
d   30  3.2
g  NaN  2.5

In [35]:
df1.join(df2, how='inner')    #取交集，双方都有的才进行显示；

   PE   PB
a  10  2.5
d  30  3.2

In [36]:
df1.join(df2, how='outer')    #取并集，保留双方所有的内容；

    PE   PB
a   10  2.5
b   20  NaN
c   25  NaN
d   30  3.2
g  NaN  2.5

#### 2.4 Merge操作: 同等数量合并

按列来进行合并（也支持按index来进行合并）

In [39]:
df1

   PE
a  10
b  20
c  25
d  30

In [38]:
df2 = pd.DataFrame(['2.5', '3.2', '2.5', '2'], 
                    index=['a', 'b', 'c','d'],
                    columns=['PB',])
df2

    PB
a  2.5
b  3.2
c  2.5
d    2

In [52]:
roe = pd.Series([0.12, 0.06, 0.08,0.02], index=['a', 'b', 'c','d'])         #添加一列一列以进行合并
df1['ROE'] = roe    #新增一列用法；
df2['ROE'] = roe

In [53]:
df1

   PE   ROE
a  10  0.12
b  20  0.06
c  25  0.08
d  30  0.02

In [54]:
df2

    PB   ROE
a  2.5  0.12
b  3.2  0.06
c  2.5  0.08
d    2  0.02

In [55]:
pd.merge(df1, df2, on = 'ROE')        #会自动根据重复列进行merge，但是索引会重置；

   PE   ROE   PB
0  10  0.12  2.5
1  20  0.06  3.2
2  25  0.08  2.5
3  30  0.02    2

In [ ]:
# Merge合并的时候如果ROE不同的话，只会合并ROE相同的数据行；
roe1 = pd.Series([0.12, 0.06, 0.08,0.02], index=['a', 'b', 'c','d']) 
roe2 = pd.Series([0.2, 0.06, 0.08,0.02], index=['a', 'b', 'c','d'])     #添加一列一列以进行合并
df1['ROE'] = roe1    #新增一列用法；
df2['ROE'] = roe2

In [58]:
df1.join(df2, lsuffix = '_l')   #lsuffix是用来增加后缀，不然两个dataframe无法合并

   PE  ROE_l   PB   ROE
a  10   0.12  2.5  0.12
b  20   0.06  3.2  0.06
c  25   0.08  2.5  0.08
d  30   0.02    2  0.02

In [64]:
pd.merge(df1, df2, left_index=True, right_index=True, how='outer',suffixes=['_df1','_df2'])    
#merge也可以通过left_index，right_index进行按index索引,可以实现等价于join的形式；

   PE  ROE_df1   PB  ROE_df2
a  10     0.12  2.5     0.12
b  20     0.06  3.2     0.06
c  25     0.08  2.5     0.08
d  30     0.02    2     0.02

In [65]:
pd.merge(df1, df2, how='outer')       #ROE这一列数据两张表格相同，所以无法看出outer和其他合并类型的区别；

   PE   ROE   PB
0  10  0.12  2.5
1  20  0.06  3.2
2  25  0.08  2.5
3  30  0.02    2

#### 2.5 Merge操作: 非同等数量合并

In [3]:
df2 = pd.DataFrame(['2.5', '3.2', '2.5'], 
                    index=['a', 'b', 'c'],
                    columns=['PB',])
df2

    PB
a  2.5
b  3.2
c  2.5

In [2]:
df1 = pd.DataFrame(['10', '20', '25', '30'], 
                    index=['a', 'b', 'c', 'd'],
                    columns=['PE',])
df1

   PE
a  10
b  20
c  25
d  30

In [4]:
roe = pd.Series([0.12, 0.08, 0.06], index=['b', 'd', 'c'])         #添加一列一列以进行合并
df1['ROE'] = roe
df2['ROE'] = roe

In [5]:
df1

   PE   ROE
a  10   NaN
b  20  0.12
c  25  0.06
d  30  0.08

In [6]:
df2

    PB   ROE
a  2.5   NaN
b  3.2  0.12
c  2.5  0.06

In [12]:
pd.merge(df1, df2)                #join是按index合并，merge是按列合并；默认是inner

   PE   ROE   PB
0  10   NaN  2.5
1  20  0.12  3.2
2  25  0.06  2.5

In [13]:
pd.merge(df1, df2, on='ROE')  # default

   PE   ROE   PB
0  10   NaN  2.5
1  20  0.12  3.2
2  25  0.06  2.5

In [14]:
pd.merge(df1, df2, how='outer')

   PE   ROE   PB
0  10   NaN  2.5
1  20  0.12  3.2
2  25  0.06  2.5
3  30  0.08  NaN

In [18]:
df1.join(df2,rsuffix = '_df2', how = 'left')

   PE   ROE   PB  ROE_df2
a  10   NaN  2.5      NaN
b  20  0.12  3.2     0.12
c  25  0.06  2.5     0.06
d  30  0.08  NaN      NaN

In [20]:
pd.merge(df1, df2, left_index=True, right_index=True, how='left')    
#merge也可以通过left_index，right_index进行按index索引

   PE  ROE_x   PB  ROE_y
a  10    NaN  2.5    NaN
b  20   0.12  3.2   0.12
c  25   0.06  2.5   0.06
d  30   0.08  NaN    NaN

In [21]:
df1 = pd.DataFrame(['10', '20', '25', '30'], 
                    index=['a', 'b', 'c', 'd'],
                    columns=['PE',])
df1

   PE
a  10
b  20
c  25
d  30

In [22]:
df2 = pd.DataFrame(['2.5', '3.2', '2.5'], 
                    index=['a', 'b', 'c'],
                    columns=['PB',])
df2

    PB
a  2.5
b  3.2
c  2.5

In [23]:
roe = pd.Series([0.12, 0.08, 0.06], index=['b', 'd', 'c'])         #添加一列一列以进行合并
df1['ROE1'] = roe
df2['ROE2'] = roe

In [24]:
df1

   PE  ROE1
a  10   NaN
b  20  0.12
c  25  0.06
d  30  0.08

In [25]:
df2

    PB  ROE2
a  2.5   NaN
b  3.2  0.12
c  2.5  0.06

In [27]:
pd.merge(df1, df2, left_on='ROE1', right_on='ROE2')     #两张DataFrame列名是不同的，但是表示是同一个的意思；

   PE  ROE1   PB  ROE2
0  10   NaN  2.5   NaN
1  20  0.12  3.2  0.12
2  25  0.06  2.5  0.06

### 3. 层次化索引

In [28]:
df = pd.Series(np.random.randn(5),                 #定义层次化索引
               index=[['a', 'a', 'b','b', 'b'],
                      [1,2,1,2,3]])

In [29]:
df

a  1   -0.541225
   2    1.499903
b  1   -0.578726
   2    0.161935
   3    0.097446
dtype: float64

In [30]:
df.index

MultiIndex(levels=[['a', 'b'], [1, 2, 3]],
           labels=[[0, 0, 1, 1, 1], [0, 1, 0, 1, 2]])

In [31]:
df['b']                       # 使用层次化索引

1   -0.578726
2    0.161935
3    0.097446
dtype: float64

In [32]:
df['a']

1   -0.541225
2    1.499903
dtype: float64

层次化索引在数据重塑中的应用

In [33]:
df.unstack()                 # 使用unstack方法将数据重新排列

          1         2         3
a -0.541225  1.499903       NaN
b -0.578726  0.161935  0.097446

In [34]:
df.unstack().stack()         # stack是unstack方法的逆运算

a  1   -0.541225
   2    1.499903
b  1   -0.578726
   2    0.161935
   3    0.097446
dtype: float64

使用层次化索引进行聚合运算

In [35]:
df.sum(level=0)             # 按照level=0进行聚合运算

a    0.958678
b   -0.319345
dtype: float64

In [37]:
df.groupby(level=0).sum()           # 按照level=0进行聚合运算

a    0.958678
b   -0.319345
dtype: float64

In [36]:
df.sum(level=1)

1   -1.119952
2    1.661838
3    0.097446
dtype: float64

声明：本资料仅限内部研究使用，切勿外传。